In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from collections import Counter
import operator
from itertools import combinations

In [2]:
data = pd.read_csv('movie_bd_v5.csv')
data.sample(2)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year
1066,tt1566501,12000000,9622846,For Greater Glory - The True Story of Cristiada,Eva Longoria|Andy GarcÃ­a|Oscar Isaac|Peter O'...,Dean Wright,The True Story of Cristiada,"A chronicle of the Cristeros War (1926-1929), ...",145,Drama,Dos Corazones,6/1/2012,6.8,2012
1681,tt0758758,15000000,56255142,Into the Wild,Emile Hirsch|Marcia Gay Harden|William Hurt|Je...,Sean Penn,Into the heart. Into the soul.,"The true story of top student and athlete, Chr...",148,Adventure|Drama,Paramount Vantage|River Road Entertainment|Art...,9/11/2007,7.7,2007

In [3]:
# get main statistic info about dataset
data.describe()

             budget       revenue      runtime  vote_average  release_year
count  1.889000e+03  1.889000e+03  1889.000000   1889.000000   1889.000000
mean   5.431083e+07  1.553653e+08   109.658549      6.140762   2007.860773
std    4.858721e+07  2.146698e+08    18.017041      0.764763      4.468841
min    5.000000e+06  2.033165e+06    63.000000      3.300000   2000.000000
25%    2.000000e+07  3.456058e+07    97.000000      5.600000   2004.000000
50%    3.800000e+07  8.361541e+07   107.000000      6.100000   2008.000000
75%    7.200000e+07  1.782626e+08   120.000000      6.600000   2012.000000
max    3.800000e+08  2.781506e+09   214.000000      8.100000   2015.000000

In [4]:
# check for missing values and type of variables
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1889 entries, 0 to 1888
Data columns (total 14 columns):
imdb_id                 1889 non-null object
budget                  1889 non-null int64
revenue                 1889 non-null int64
original_title          1889 non-null object
cast                    1889 non-null object
director                1889 non-null object
tagline                 1889 non-null object
overview                1889 non-null object
runtime                 1889 non-null int64
genres                  1889 non-null object
production_companies    1889 non-null object
release_date            1889 non-null object
vote_average            1889 non-null float64
release_year            1889 non-null int64
dtypes: float64(1), int64(4), object(9)
memory usage: 206.7+ KB

# Предобработка

In [5]:
answers = {} # создадим словарь для ответов

# тут другие ваши предобработки колонок например:

#the time given in the dataset is in string format.
#So we need to change this in datetime format
# ...


# new column for "profit" (question 6)
data["profit"] = data["revenue"] - data["budget"]

# new column for length of titles (question 24)
data["title_len"] = data["original_title"].str.len()

# new column for length of description (question 25)
data['descr_len'] = data['overview'].str.count(' ') + 1

# check if new columns are there
data.head(3)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit,title_len,descr_len
0,tt0369610,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,6.5,2015,1363528810,14,26
1,tt1392190,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,7.1,2015,228436354,18,110
2,tt2908446,110000000,295238201,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,Robert Schwentke,One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,6.3,2015,185238201,9,22

In [6]:
# FUNCTIONS

# function takes as an input Series with values which frequencies want to count
# split strings based on "|" symbol as separator, expand so that each value is in its own column 
# iterate with for loop over all columns
# put values in dictionary and count occurrencies of each value
# gives back 5 first items of sorted dictionary

def count_values_expand(series):
    data = series.str.split("|", expand = True)

    dictionary = {}
    count = 0

    for column in list(data.columns):
        for i in data[column]:
            if i in dictionary:
                dictionary[i] = dictionary[i] + 1
            else:
                dictionary[i] = count + 1

    sorted_dictionary = dict(sorted(dictionary.items(), key=operator.itemgetter(1), reverse=True)) 
    
    return list(sorted_dictionary.items())[:5]


# function takes as an input Series with values which frequencies want to count
# split strings based on "|" symbol as separator, explode so that each value is in its own row
# gives back frequencies
# (used in questions 11, 12, 14, 16, 17, 23)

def count_values_explode(series):
    series = series.str.split("|")
    series = series.explode()
    series.reset_index()
    new_series = series.value_counts().head()
    return new_series

# 1. У какого фильма из списка самый большой бюджет?

Использовать варианты ответов в коде решения запрещено.    
Вы думаете и в жизни у вас будут варианты ответов?)

In [7]:
# в словарь вставляем номер вопроса и ваш ответ на него
# Пример: 
answers['1'] = '2. Spider-Man 3 (tt0413300)'


# запишите свой вариант ответа
answers['1'] = '5. Pirates of the Caribbean: On Stranger Tides (tt1298650)'

# если ответили верно, можете добавить комментарий со значком "+"
# +

In [8]:
# тут пишем ваш код для решения данного вопроса:

# filter data by max value in column "budget"
# select columns "original_title", "budget" to display
data[data['budget'] == data['budget'].max()][["original_title", "budget" ]]

                                  original_title     budget
723  Pirates of the Caribbean: On Stranger Tides  380000000

ВАРИАНТ 2

In [9]:
# можно добавлять разные варианты решения

# find observations with maximum value in "budget" column with idxmax() method
data.iloc[data['budget'].idxmax()]

imdb_id                                                         tt1298650
budget                                                          380000000
revenue                                                        1021683000
original_title                Pirates of the Caribbean: On Stranger Tides
cast                    Johnny Depp|PenÃ©lope Cruz|Geoffrey Rush|Ian M...
director                                                     Rob Marshall
tagline                                       Live Forever Or Die Trying.
overview                Captain Jack Sparrow crosses paths with a woma...
runtime                                                               136
genres                                           Adventure|Action|Fantasy
production_companies    Walt Disney Pictures|Jerry Bruckheimer Films|M...
release_date                                                    5/11/2011
vote_average                                                          6.3
release_year                                                         2011
profit                                                          641683000
title_len                                                              43
descr_len                                                              75
Name: 723, dtype: object

# 2. Какой из фильмов самый длительный (в минутах)?

In [10]:
# думаю логику работы с этим словарем вы уже поняли, 
# по этому не буду больше его дублировать

##### "поэтому" - пишется слитно, прошу простить за дотошность))))""

answers['2'] = '2. Gods and Generals (tt0279111)'

# +

In [11]:
# Вариант 1

# filter data by max value in column "runtime"
# select columns "original_title", "runtime" to display
data[data['runtime'] == data['runtime'].max()][["original_title", 'runtime']]

         original_title  runtime
1157  Gods and Generals      214

In [12]:
# Вариант 2

# find observations with maximum value in "runtime" column with idxmax() method
data.iloc[data['runtime'].idxmax()]

imdb_id                                                         tt0279111
budget                                                           56000000
revenue                                                          12923936
original_title                                          Gods and Generals
cast                    Stephen Lang|Jeff Daniels|Robert Duvall|Kevin ...
director                                                Ronald F. Maxwell
tagline                               The nations heart was touched by...
overview                The film centers mostly around the personal an...
runtime                                                               214
genres                                                  Drama|History|War
production_companies                   Turner Pictures|Antietam Filmworks
release_date                                                    2/21/2003
vote_average                                                          5.8
release_year                                                         2003
profit                                                          -43076064
title_len                                                              17
descr_len                                                              48
Name: 1157, dtype: object

# 3. Какой из фильмов самый короткий (в минутах)?

In [13]:
answers['3'] = '3. Winnie the Pooh (tt1449283)'

# +

In [14]:
# Вариант 1

# filter data by min value in column "runtime"
# select columns "original_title", "runtime" to display
data[data["runtime"] == data["runtime"].min()][["original_title", 'runtime']]

      original_title  runtime
768  Winnie the Pooh       63

In [15]:
# Вариант 2

# find observations with maximum value in "budget" column with idxmin() method
data.iloc[data['runtime'].idxmin()]

imdb_id                                                         tt1449283
budget                                                           30000000
revenue                                                          14460000
original_title                                            Winnie the Pooh
cast                    Jim Cummings|Travis Oates|Jim Cummings|Bud Luc...
director                                        Stephen Anderson|Don Hall
tagline                                                          Oh Pooh.
overview                During an ordinary day in Hundred Acre Wood, W...
runtime                                                                63
genres                                                   Animation|Family
production_companies    Walt Disney Pictures|Walt Disney Animation Stu...
release_date                                                    4/13/2011
vote_average                                                          6.8
release_year                                                         2011
profit                                                          -15540000
title_len                                                              15
descr_len                                                              52
Name: 768, dtype: object

# 4. Какова средняя длительность фильмов?

In [16]:
answers["4"] = "2. 110"

# +

In [17]:
# Вариант 1

# Use mean() method
round(data.runtime.mean(),0)

110.0

In [18]:
# Вариант 2

# Use describe() method, can see the mean in 2nd row
data.describe()

,budget,revenue,runtime,vote_average,release_year,profit,title_len,descr_len
count,1.889000e+03,1.889000e+03,1889.000000,1889.000000,1889.000000,1.889000e+03,1889.000000,1889.000000
mean,5.431083e+07,1.553653e+08,109.658549,6.140762,2007.860773,1.010545e+08,15.037057,52.410270
std,4.858721e+07,2.146698e+08,18.017041,0.764763,4.468841,1.830733e+08,8.552660,26.631917
min,5.000000e+06,2.033165e+06,63.000000,3.300000,2000.000000,-1.657101e+08,1.000000,10.000000
25%,2.000000e+07,3.456058e+07,97.000000,5.600000,2004.000000,5.000000e+06,9.000000,32.000000
50%,3.800000e+07,8.361541e+07,107.000000,6.100000,2008.000000,4.400041e+07,13.000000,48.000000
75%,7.200000e+07,1.782626e+08,120.000000,6.600000,2012.000000,1.201842e+08,18.000000,67.000000
max,3.800000e+08,2.781506e+09,214.000000,8.100000,2015.000000,2.544506e+09,83.000000,175.000000

# 5. Каково медианное значение длительности фильмов?

In [19]:
answers["5"] = "1. 107"

#+

In [20]:
# Вариант 1

# Use median() method
round(data.runtime.median(),0)

107.0

In [21]:
# Вариант 2

# Use describe() method, median is 50% quantile
data.describe()

,budget,revenue,runtime,vote_average,release_year,profit,title_len,descr_len
count,1.889000e+03,1.889000e+03,1889.000000,1889.000000,1889.000000,1.889000e+03,1889.000000,1889.000000
mean,5.431083e+07,1.553653e+08,109.658549,6.140762,2007.860773,1.010545e+08,15.037057,52.410270
std,4.858721e+07,2.146698e+08,18.017041,0.764763,4.468841,1.830733e+08,8.552660,26.631917
min,5.000000e+06,2.033165e+06,63.000000,3.300000,2000.000000,-1.657101e+08,1.000000,10.000000
25%,2.000000e+07,3.456058e+07,97.000000,5.600000,2004.000000,5.000000e+06,9.000000,32.000000
50%,3.800000e+07,8.361541e+07,107.000000,6.100000,2008.000000,4.400041e+07,13.000000,48.000000
75%,7.200000e+07,1.782626e+08,120.000000,6.600000,2012.000000,1.201842e+08,18.000000,67.000000
max,3.800000e+08,2.781506e+09,214.000000,8.100000,2015.000000,2.544506e+09,83.000000,175.000000

# 6. Какой самый прибыльный фильм?
#### Внимание! Здесь и далее под «прибылью» или «убытками» понимается разность между сборами и бюджетом фильма. (прибыль = сборы - бюджет) в нашем датасете это будет (profit = revenue - budget)

In [22]:
answers["6"] = "5. Avatar (tt0499549)"

#+

In [23]:
# лучше код получения столбца profit вынести в Предобработку что в начале

# filter data by max value in column "profit"
# select columns "original_title", "profit" to display
data[data["profit"] == data["profit"].max()][["original_title","profit" ]]

    original_title      profit
239         Avatar  2544505847

# 7. Какой фильм самый убыточный?

In [24]:
answers["7"] = "5. The Lone Ranger (tt1210819)"

#+

In [25]:
# filter data by min value in column "profit"
# select columns "original_title", "profit" to display

data[data["profit"] == data["profit"].min()][["original_title","profit" ]]

       original_title     profit
1245  The Lone Ranger -165710090

# 8. У скольких фильмов из датасета объем сборов оказался выше бюджета?

In [26]:
answers["8"] = "1. 1478"

#+

In [27]:
# Вариант 1

# filter data, select observations with positive profit,
# use method count() to count observations
data[data["profit"] > 0].count()

imdb_id                 1478
budget                  1478
revenue                 1478
original_title          1478
cast                    1478
director                1478
tagline                 1478
overview                1478
runtime                 1478
genres                  1478
production_companies    1478
release_date            1478
vote_average            1478
release_year            1478
profit                  1478
title_len               1478
descr_len               1478
dtype: int64

In [28]:
# Вариант 2

# filter data, select observations with positive profit, 
# nethod len() gives number of observations corresponding filtering conditions

len(data[data["profit"] > 0])

1478

In [29]:
# Вариант 3

# using describe() method, first row gives number 1478
data[data["profit"] > 0].describe()

,budget,revenue,runtime,vote_average,release_year,profit,title_len,descr_len
count,1.478000e+03,1.478000e+03,1478.000000,1478.000000,1478.000000,1.478000e+03,1478.000000,1478.000000
mean,5.742285e+07,1.915854e+08,110.126522,6.240122,2008.039242,1.341626e+08,15.292287,53.547361
std,5.170014e+07,2.295625e+08,18.288838,0.738106,4.479981,1.941708e+08,8.817403,26.862752
min,5.000000e+06,8.203235e+06,72.000000,3.400000,2000.000000,2.000000e+06,1.000000,10.000000
25%,2.000000e+07,5.903202e+07,97.000000,5.800000,2004.000000,2.724810e+07,9.000000,34.000000
50%,4.000000e+07,1.130136e+08,107.000000,6.200000,2008.000000,6.709555e+07,13.000000,50.000000
75%,7.875000e+07,2.218417e+08,121.000000,6.700000,2012.000000,1.507748e+08,19.000000,67.000000
max,3.800000e+08,2.781506e+09,201.000000,8.100000,2015.000000,2.544506e+09,83.000000,169.000000

# 9. Какой фильм оказался самым кассовым в 2008 году?

In [30]:
answers["9"] = "4. The Dark Knight (tt0468569)"

# +

In [31]:
# Вариант 1

# Count based on "profit", 
# select movies issued in 2008, sort values by "profit" attribute in descending order
# display first row with head() method and columns "original_title","profit"

data[(data["release_year"] == 2008)][["original_title","profit"]].sort_values(by = "profit", ascending = False).head(1)

      original_title     profit
599  The Dark Knight  816921825

In [32]:
# same as above but count based on "revenue"
data[(data["release_year"] == 2008)][["original_title","revenue", "profit"]].sort_values(by = "revenue", ascending = False).head(1)

# answer is the same

      original_title     revenue     profit
599  The Dark Knight  1001921825  816921825

In [33]:
# Вариант 2

# filter only data for year 2008, copy data 
profit_2008 = data[data["release_year"] == 2008].copy()

# Count based on max revenue, using method max()
# display columns "original_title","profit"
profit_2008[profit_2008["revenue"] == profit_2008["revenue"].max()][["original_title","revenue", "profit"]]

      original_title     revenue     profit
599  The Dark Knight  1001921825  816921825

In [34]:
# Count based on max profit
profit_2008[profit_2008["profit"] == profit_2008["profit"].max()][["original_title","revenue", "profit"]]

      original_title     revenue     profit
599  The Dark Knight  1001921825  816921825

# 10. Самый убыточный фильм за период с 2012 по 2014 г. (включительно)?

In [35]:
answers["10"] = "5. The Lone Ranger -165710090"

# +

In [36]:
# Filter data from 2012 to 2014 included
# Sort values by "profit", by default it is sorted in ascending order
# Display  columns "original_title" and "profit" and first row with head(1) method

data[(data["release_year"] >= 2012) & (data["release_year"] <= 2014)][["original_title","profit"]].sort_values(by = "profit").head(1)

       original_title     profit
1245  The Lone Ranger -165710090

# 11. Какого жанра фильмов больше всего?

In [37]:
# эту задачу тоже можно решать разными подходами, попробуй реализовать разные варианты
# если будешь добавлять функцию - выноси ее в предобработку что в начале

answers["11"] = "3. Drama"

# +

In [38]:
# Вариант 1

# Copy data 
data_genres = data.copy()

# Define series corresponding to column "genres"
genres = data_genres.genres

# Apply function count_values_expand, base on using "expand" method
count_values_expand(genres)

[(None, 4338),
 ('Drama', 782),
 ('Comedy', 683),
 ('Thriller', 596),
 ('Action', 582)]

In [39]:
# Вариант 2 

# Apply function based on "explode" method. Use as input series define previously
count_values_explode(genres)

Drama        782
Comedy       683
Thriller     596
Action       582
Adventure    415
Name: genres, dtype: int64

In [40]:
# Вариант 3

from collections import Counter

# Copy data
data_genres2 = data.copy()

# Split text based on "|" symbol
data_genres2["genres"] = data_genres2.genres.str.split("|")

# Every genre put in separate row using "explode" method
genres2 = data_genres2.explode("genres")["genres"]

# Count all genres occurrencies, put in dictionary, display on descending order of values
c = Counter(genres2)
c.most_common

<bound method Counter.most_common of Counter({'Drama': 782, 'Comedy': 683, 'Thriller': 596, 'Action': 582, 'Adventure': 415, 'Crime': 315, 'Romance': 308, 'Family': 260, 'Science Fiction': 248, 'Fantasy': 222, 'Horror': 176, 'Mystery': 168, 'Animation': 139, 'Music': 64, 'History': 62, 'War': 58, 'Western': 19, 'Documentary': 8, 'Foreign': 2})>

# 12. Фильмы какого жанра чаще всего становятся прибыльными?

In [41]:
answers["12"] = "1. Drama"

In [42]:
# вариант 1

# filter movies with profit (i.e. with  profit > 0 )
profit_movies = data_genres[data_genres["profit"] > 0]

# define series corresponding to column "genres"
genres_profit = profit_movies.genres

# apply function based on "expand" method
count_values_expand(genres_profit)

[(None, 3428),
 ('Drama', 560),
 ('Comedy', 551),
 ('Thriller', 446),
 ('Action', 444)]

In [43]:
# вариант 2

#apply function based on "explode" method, previously define series is used as input to function
count_values_explode(genres_profit)

Drama        560
Comedy       551
Thriller     446
Action       444
Adventure    337
Name: genres, dtype: int64

# 13. У какого режиссера самые большие суммарные кассовые сборы?

In [44]:
answers["13"] = "5. Peter Jackson"

# +

In [45]:
# group data by "director" column, sum revenue for each director, display first 5 results in descending order
data.groupby("director").revenue.sum().sort_values(ascending = False).head()

director
Peter Jackson        6490593685
Christopher Nolan    4167548502
David Yates          4154295625
Michael Bay          3886938960
J.J. Abrams          3579169916
Name: revenue, dtype: int64

# 14. Какой режисер снял больше всего фильмов в стиле Action?

In [46]:
answers["14"] = "3. Robert Rodriguez"

# +

In [47]:
#filter observations with genre "Action"

action_movies = data[data.genres.str.contains("Action", na = False)].copy()
action_movies.head(3)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit,title_len,descr_len
0,tt0369610,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,6.5,2015,1363528810,14,26
1,tt1392190,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,7.1,2015,228436354,18,110
3,tt2488496,200000000,2068178225,Star Wars: The Force Awakens,Harrison Ford|Mark Hamill|Carrie Fisher|Adam D...,J.J. Abrams,Every generation has a story.,Thirty years after defeating the Galactic Empi...,136,Action|Adventure|Science Fiction|Fantasy,Lucasfilm|Truenorth Productions|Bad Robot,12/15/2015,7.5,2015,1868178225,28,26

In [48]:
# вариант 1

# define series corresponding to column "director"
action_movies_directors = action_movies.director

# apply function based on method "expand"
count_values_expand(action_movies_directors)

[(None, 2869),
 ('Robert Rodriguez', 9),
 ('Michael Bay', 7),
 ('Paul W.S. Anderson', 7),
 ('Antoine Fuqua', 6)]

In [49]:
# вариант 2

# apply function based on method "explode" using series defined previously as input
count_values_explode(action_movies_directors)

Robert Rodriguez      9
Michael Bay           7
Paul W.S. Anderson    7
Antoine Fuqua         6
Ridley Scott          6
Name: director, dtype: int64

In [50]:
# count only unique values gives a wrong answer as there are movies with several directors

action_movies["director"].value_counts().head(10)

Paul W.S. Anderson    7
Michael Bay           7
Robert Rodriguez      6
Antoine Fuqua         6
Ridley Scott          6
Andrzej Bartkowiak    5
Rob Cohen             5
Zack Snyder           5
Roland Emmerich       5
Peter Berg            5
Name: director, dtype: int64

# 15. Фильмы с каким актером принесли самые высокие кассовые сборы в 2012 году?

In [51]:
answers["15"] = "3. Chris Hemsworth"

# +

In [52]:
# select movies issued in 2012, sort by "revenue" in descending order, display first 5 rows
d = data.loc[(data["release_year"] == 2012), ["original_title", "cast", "revenue"]].sort_values("revenue", ascending=False).head(5)
print(d.values)

[['The Avengers'
  'Robert Downey Jr.|Chris Evans|Mark Ruffalo|Chris Hemsworth|Scarlett Johansson'
  1519557910]
 ['Skyfall'
  'Daniel Craig|Judi Dench|Javier Bardem|Ralph Fiennes|Naomie Harris'
  1108561013]
 ['The Dark Knight Rises'
  'Christian Bale|Michael Caine|Gary Oldman|Anne Hathaway|Tom Hardy'
  1081041287]
 ['The Hobbit: An Unexpected Journey'
  'Ian McKellen|Martin Freeman|Richard Armitage|Andy Serkis|Cate Blanchett'
  1017003568]
 ['Ice Age: Continental Drift'
  'John Leguizamo|Ray Romano|Chris Wedge|Denis Leary|Seann William Scott'
  877244782]]

# 16. Какой актер снялся в большем количестве высокобюджетных фильмов?

In [53]:
answers["16"] = "3. Matt Damon"

# +

In [54]:
# define new data set including movies with budget above average
high_budget_movies = data[data["budget"] > data["budget"].mean()].copy()

# check new mean and basic statistical info about new data set
high_budget_movies.describe()

,budget,revenue,runtime,vote_average,release_year,profit,title_len,descr_len
count,6.710000e+02,6.710000e+02,671.000000,671.000000,671.000000,6.710000e+02,671.000000,671.000000
mean,1.053507e+08,3.034392e+08,116.186289,6.203577,2007.783905,1.980885e+08,16.488823,55.435171
std,4.793159e+07,2.921528e+08,21.618874,0.747245,4.562283,2.650328e+08,9.978609,27.074660
min,5.500000e+07,5.409517e+06,76.000000,4.000000,2000.000000,-1.657101e+08,2.000000,11.000000
25%,7.000000e+07,1.082004e+08,100.000000,5.700000,2004.000000,2.364953e+07,10.000000,35.000000
50%,8.800000e+07,2.118179e+08,114.000000,6.200000,2008.000000,1.161725e+08,14.000000,53.000000
75%,1.300000e+08,3.943003e+08,130.000000,6.700000,2012.000000,2.762368e+08,20.000000,68.000000
max,3.800000e+08,2.781506e+09,214.000000,8.100000,2015.000000,2.544506e+09,62.000000,169.000000

In [55]:
# вариант 1

# define series corresponding to "cast" column
high_budget_cast = high_budget_movies["cast"]

# apply function based on "expand" method
count_values_expand(high_budget_cast)

[('Matt Damon', 18),
 ('Adam Sandler', 17),
 ('Angelina Jolie', 16),
 ('Tom Cruise', 15),
 ('Eddie Murphy', 15)]

In [56]:
# вариант 2

# apply function based on "explode" method
count_values_explode(high_budget_cast)

Matt Damon           18
Adam Sandler         17
Angelina Jolie       16
Samuel L. Jackson    15
Tom Cruise           15
Name: cast, dtype: int64

# 17. В фильмах какого жанра больше всего снимался Nicolas Cage?

In [57]:
answers["17"] = "2. Action"

# +

In [58]:
# create data set contaiting movies with Nicolas Cage
cage = data[data["cast"].str.contains("Nicolas Cage")].copy()

# define series corresponding to "genres" column
cage_genres = cage.genres

# apply function based on "expand" method
count_values_expand(cage_genres)

[(None, 42), ('Action', 17), ('Thriller', 15), ('Drama', 12), ('Crime', 10)]

In [59]:
# apply function based on "explode" method
count_values_explode(cage_genres)

Action      17
Thriller    15
Drama       12
Crime       10
Fantasy      8
Name: genres, dtype: int64

# 18. Самый убыточный фильм от Paramount Pictures

In [60]:
answers["18"] = "1.K-19: The Widowmaker (tt0267626)"

# +

In [61]:
# Select data only with "Paramount Pictures" as production company
paramount = data[data["production_companies"].str.contains("Paramount Pictures")][["original_title","profit","production_companies" ]]

# Sort data based on "profit", in ascending order by default
paramount.sort_values("profit").head(3)

,original_title,profit,production_companies
925,K-19: The Widowmaker,-64831034,Paramount Pictures|Intermedia Films|National G...
1123,Timeline,-60519261,Paramount Pictures|Donners' Company|Mutual Fil...
1722,Next,-51788987,Paramount Pictures|Virtual Studios|Revolution ...

# 19. Какой год стал самым успешным по суммарным кассовым сборам?

In [62]:
answers["19"] = "5. 2015"

# +

In [63]:
# group data by release year, summuraize revenue per year, sort result in descending order, display 5 first rows
data.groupby("release_year").revenue.sum().sort_values(ascending = False).head()

release_year
2015    25449202382
2014    23405862953
2013    23213799791
2012    23079001687
2011    22676791872
Name: revenue, dtype: int64

# 20. Какой самый прибыльный год для студии Warner Bros?

In [64]:
answers["20"] = "1. 2014"

# +

In [65]:
# Create dataframe containing data for Warner Bros
warner = data[data["production_companies"].str.contains("Warner")]

# Grouping by year, summing profit values, sorting results in descending order
warner.groupby("release_year").profit.sum().sort_values(ascending = False).head()

release_year
2014    2295464519
2007    2208217007
2008    2134595031
2010    1974712985
2011    1871393682
Name: profit, dtype: int64

In [66]:
# Same code as above but put in one line without creating additinal dataframe 

data[data["production_companies"].str.contains("Warner")].groupby("release_year").profit.sum().sort_values(ascending = False).head(3)

release_year
2014    2295464519
2007    2208217007
2008    2134595031
Name: profit, dtype: int64

# 21. В каком месяце за все годы суммарно вышло больше всего фильмов?

In [67]:
answers["21"] = "4. Сентябрь"

# +

In [68]:
# copy data set
data_dates = data.copy() 

# add column "Month", extract month number from "releae_date"
data_dates['Month'] = pd.DatetimeIndex(data_dates['release_date']).month

# select columns "Month" and "original_title"
data_dates_short = data_dates[["Month", "original_title"]]

# grouping data by month, count number of movies per month, display results in descending order
all_months = data_dates_short.groupby("Month").count().sort_values("original_title", ascending= False)
all_months

       original_title
Month
9                 227
12                190
10                186
8                 161
3                 156
4                 149
6                 147
11                146
7                 142
5                 140
2                 135
1                 110

# 22. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)

In [69]:
answers["22"] = "2. 450"

# +

In [70]:
# Вариант 1.

# Put data by month from above into dataframe
m = all_months.reset_index()

# Select data for 3 summer months 
m[(m.Month == 6) | (m.Month == 7) | (m.Month == 8)]["original_title"].sum()

450

In [71]:
# Вариант 2, посчитать "вручную", взяв значения из таблицы вопроса 21.

147 + 142 + 161

450

# 23. Для какого режиссера зима – самое продуктивное время года?

In [72]:
answers["23"] = "5.  Peter Jackson "

# +

In [73]:
#Какой режиссер выпускает (суммарно по годам) больше всего фильмов зимой?

# Create data set containing observations for winter months
winter = data_dates[ (data_dates["Month"]==12) | (data_dates["Month"]==1) | (data_dates["Month"]==2)].copy()
winter.head(3)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit,title_len,descr_len,Month
3,tt2488496,200000000,2068178225,Star Wars: The Force Awakens,Harrison Ford|Mark Hamill|Carrie Fisher|Adam D...,J.J. Abrams,Every generation has a story.,Thirty years after defeating the Galactic Empi...,136,Action|Adventure|Science Fiction|Fantasy,Lucasfilm|Truenorth Productions|Bad Robot,12/15/2015,7.5,2015,1868178225,28,26,12
5,tt1663202,135000000,532950503,The Revenant,Leonardo DiCaprio|Tom Hardy|Will Poulter|Domhn...,Alejandro GonzÃ¡lez IÃ±Ã¡rritu,"(n. One who has returned, as if from the dead.)","In the 1820s, a frontiersman, Hugh Glass, sets...",156,Western|Drama|Adventure|Thriller,Regency Enterprises|Appian Way|CatchPlay|Anony...,12/25/2015,7.2,2015,397950503,12,25,12
11,tt1617661,176000003,183987723,Jupiter Ascending,Mila Kunis|Channing Tatum|Sean Bean|Eddie Redm...,Lana Wachowski|Lilly Wachowski,Expand your universe.,In a universe where human genetic material is ...,124,Science Fiction|Fantasy|Action|Adventure,Village Roadshow Pictures|Dune Entertainment|A...,2/4/2015,5.2,2015,7987720,17,30,2

In [74]:
# Option 1

# Define series corresponding to "director" column
dir_winter = winter.director

# Apply function based on "expand" method
count_values_expand(dir_winter)

[(None, 4749),
 ('Peter Jackson', 7),
 ('Clint Eastwood', 6),
 ('Steven Soderbergh', 6),
 ('Shawn Levy', 4)]

In [75]:
# Option 2

# Apply function based on "explode" method
count_values_explode(dir_winter)

Peter Jackson        7
Steven Soderbergh    6
Clint Eastwood       6
Shawn Levy           4
Martin Scorsese      4
Name: director, dtype: int64

# 24. Какая студия дает самые длинные названия своим фильмам по количеству символов?

In [76]:
answers["24"] = "5. Four By Two Productions"

# +

In [77]:
prod_companies = data.copy()

# Select column "production_companies", split the content based on "|" symbol
prod_companies["production_companies"] = prod_companies["production_companies"].str.split("|")

# Put every production company in its own row using "explode" method
prod_companies = prod_companies.explode("production_companies")

# Group data by production companies, count mean of movies names (number of symbols)
# Sort in descending order, display first 5 rows, put into dataframe format with "reset_index" method
prod_companies.groupby("production_companies")["title_len"].mean().sort_values(ascending = False).head().reset_index()

        production_companies  title_len
0    Four By Two Productions       83.0
1    Jim Henson Company, The       59.0
2              Dos Corazones       47.0
3  Museum Canada Productions       46.0
4               Polsky Films       46.0

# 25. Описание фильмов какой студии в среднем самые длинные по количеству слов?

In [78]:
answers["25"] = "3. Midnight Picture Show"

# +

In [79]:
# Group data as above, count mean length of description
# Sort in descending order, display 5 first rows, put into dataframe format with reset_index method
prod_companies.groupby("production_companies")['descr_len'].mean().sort_values(ascending = False).head().reset_index()

               production_companies  descr_len
0             Midnight Picture Show      175.0
1              Room 9 Entertainment      161.0
2    Heineken Branded Entertainment      161.0
3                98 MPH Productions      159.0
4  Brookwell-McNamara Entertainment      156.0

# 26. Какие фильмы входят в 1 процент лучших по рейтингу? 
по vote_average

In [80]:
answers["26"] = "1. Inside Out, The Dark Knight, 12 Years a Slave"

# +

In [81]:
# вариант 1

# create "Percentil Rank" column, count percentiles based on "vote_average" column
data['Percentile Rank'] = data.vote_average.rank(pct = True)

# select data with percentile value larger than 0.99
data[data['Percentile Rank'] > 0.99][["original_title", "vote_average", "Percentile Rank" ]]

,original_title,vote_average,Percentile Rank
9,Inside Out,8.0,0.998677
34,Room,8.0,0.998677
118,Interstellar,8.0,0.998677
119,Guardians of the Galaxy,7.9,0.995236
125,The Imitation Game,8.0,0.998677
128,Gone Girl,7.9,0.995236
138,The Grand Budapest Hotel,7.9,0.995236
370,Inception,7.9,0.995236
599,The Dark Knight,8.1,1.000000
872,The Pianist,7.9,0.995236
1081,The Lord of the Rings: The Return of the King,7.9,0.995236
1183,The Wolf of Wall Street,7.9,0.995236
1191,12 Years a Slave,7.9,0.995236
1800,Memento,7.9,0.995236

In [82]:
# вариант 2

data['Percentile Rank'] = data.vote_average.rank(pct = True)

# Sort values by "Percentile Rank" column, display first 15 values in descending order
data[["original_title", "vote_average", "Percentile Rank" ]].sort_values(by = 'Percentile Rank', ascending = False).head(15)

,original_title,vote_average,Percentile Rank
599,The Dark Knight,8.1,1.000000
118,Interstellar,8.0,0.998677
125,The Imitation Game,8.0,0.998677
9,Inside Out,8.0,0.998677
34,Room,8.0,0.998677
1183,The Wolf of Wall Street,7.9,0.995236
128,Gone Girl,7.9,0.995236
1191,12 Years a Slave,7.9,0.995236
119,Guardians of the Galaxy,7.9,0.995236
1081,The Lord of the Rings: The Return of the King,7.9,0.995236
1800,Memento,7.9,0.995236
370,Inception,7.9,0.995236
872,The Pianist,7.9,0.995236
138,The Grand Budapest Hotel,7.9,0.995236
1188,Her,7.8,0.989148

# 27. Какие актеры чаще всего снимаются в одном фильме вместе?

In [83]:
answers["27"] = "5. Daniel Radcliffe & Rupert Grint"

# +

In [84]:
# copy data to new data set
actors_pairs = data.copy()

# split "cast" column content based on "|" symbol
actors_pairs["cast"] = actors_pairs["cast"].str.split("|")

# Select "original_title", "cast" columns
actors_pairs[["original_title", "cast"]].head(3)

       original_title                                               cast
0      Jurassic World  [Chris Pratt, Bryce Dallas Howard, Irrfan Khan...
1  Mad Max: Fury Road  [Tom Hardy, Charlize Theron, Hugh Keays-Byrne,...
2           Insurgent  [Shailene Woodley, Theo James, Kate Winslet, A...

In [85]:
# define all combinations in each row in "cast" column
actors_pairs["cast"] = actors_pairs.cast.apply(lambda x: list(combinations(sorted(x), 2)))
actors_pairs[["original_title", "cast"]].head(3)

       original_title                                               cast
0      Jurassic World  [(Bryce Dallas Howard, Chris Pratt), (Bryce Da...
1  Mad Max: Fury Road  [(Charlize Theron, Hugh Keays-Byrne), (Charliz...
2           Insurgent  [(Ansel Elgort, Kate Winslet), (Ansel Elgort, ...

In [86]:
# Put each combination in a separate row, count occurrencies for each combination
actors_pairs.explode("cast")["cast"].value_counts()

(Emma Watson, Rupert Grint)              8
(Daniel Radcliffe, Rupert Grint)         8
(Daniel Radcliffe, Emma Watson)          8
(Ben Stiller, Owen Wilson)               6
(Helena Bonham Carter, Johnny Depp)      6
                                        ..
(Jeremy Marinas, Tiger Hu Chen)          1
(Augustus Prew, Ioan Gruffudd)           1
(Radha Mitchell, Rhiana Griffith)        1
(Aishwarya Rai Bachchan, Colin Firth)    1
(Jessica Biel, Rufus Sewell)             1
Name: cast, Length: 17943, dtype: int64

# Submission

In [87]:
# в конце можно посмотреть свои ответы к каждому вопросу
answers

{'1': '5. Pirates of the Caribbean: On Stranger Tides (tt1298650)',
 '2': '2. Gods and Generals (tt0279111)',
 '3': '3. Winnie the Pooh (tt1449283)',
 '4': '2. 110',
 '5': '1. 107',
 '6': '5. Avatar (tt0499549)',
 '7': '5. The Lone Ranger (tt1210819)',
 '8': '1. 1478',
 '9': '4. The Dark Knight (tt0468569)',
 '10': '5. The Lone Ranger -165710090',
 '11': '3. Drama',
 '12': '1. Drama',
 '13': '5. Peter Jackson',
 '14': '3. Robert Rodriguez',
 '15': '3. Chris Hemsworth',
 '16': '3. Matt Damon',
 '17': '2. Action',
 '18': '1.K-19: The Widowmaker (tt0267626)',
 '19': '5. 2015',
 '20': '1. 2014',
 '21': '4. Сентябрь',
 '22': '2. 450',
 '23': '5.  Peter Jackson ',
 '24': '5. Four By Two Productions',
 '25': '3. Midnight Picture Show',
 '26': '1. Inside Out, The Dark Knight, 12 Years a Slave',
 '27': '5. Daniel Radcliffe & Rupert Grint'}

In [88]:
# и убедиться что ни чего не пропустил)
len(answers)

27